Rhino.Render.RdkCmnEventWatcher
This class is used to manage the following override:
static class CRdkCmnEventWatcher : public CRhRdkEventSink
{
...
virtual void OnDocumentSettingsChanged(UINT uFlags, UINT_PTR uContext);
...
};

Rhino.Render.RdkCmnEventWatcher.Add(UnsafeNativeMethods.EventSyncDocumentSettingsChangedFlag,System.EventHandler{Rhino.Render.RenderPropertyChangedEvent})
Called when adding a delegate to a event, see the GroundPlane.Changed
event for an example.
type:
The event watcher type index
value:
Delegate to add

Rhino.Render.RdkCmnEventWatcher.Remove(UnsafeNativeMethods.EventSyncDocumentSettingsChangedFlag,System.EventHandler{Rhino.Render.RenderPropertyChangedEvent})
Called when removing a delegate from an event, see the
GroundPlane.Changed event for an example.
type:
The event watcher type index
value:
Delegate to remove

Rhino.Render.RdkCmnEventWatcher.OnSettingsChanged(System.Int32,System.Int32)
Called after any RDK document settings have been changed.
CRdkCmnEventWatcher::OnDocumentSettingsChanged(UINT uFlags, UINT_PTR uContext)
flags: A bit mask specifying what has changed
context:
Provides extra information, parameter is usually zero but in the case of 'rendering'

Rhino.Render.RdkCmnEventWatcher.g_settings_changed_hook
Gets set as soon as a event delegate is added, will point to
OnSettingsChanged.

Rhino.Render.RdkCmnEventWatcher.g_event_dictionary
Event delegate dictionary

Rhino.Render.RdkCmnEventWatcher.IsEmpty
Iterate the event list and see if any have been hooked.