Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(System.Int32)
Show Rhino or Beta expired message
mode:
Returns:

Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Windows.Forms.IWin32Window,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)
This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense
is used by Rhino C++ plug-ins.