Rhino.Render.RenderPrimitive.HasRenderMaterial
This property will be true if this mesh has a Rhino.Render.RenderPrimitive.RenderMaterial associated with
it or false if there is a Rhino.Render.RenderPrimitive.Material.