Rhino.Render.RenderPipeline.SaveImage(System.String,System.Boolean)
Saves the rendered image to a file.
fileName:
the full path to the file name to save to. If null or empty a file
dialog will be displayed prompting the user for a save file name.
saveAlpha:
Determines if alpha will be saved in files that support it (e.g., PNG).
Returns:
Returns true if a file was written or false if a file dialog was
canceled or the file was not written.

Rhino.Render.RenderPipeline.SaveImage(System.String)
Saves the rendered image to a file.
fileName:
the full path to the file name to save to. If null or empty a file
dialog will be displayed prompting the user for a save file name.
Returns:
Returns true if a file was written or false if a file dialog was
canceled or the file was not written.