Rhino.Render.RdkPlugIn.FromRenderConentClassType(System.Type)
Check each RdkPlugIn in the Render Development Kit(RDK) dictionary and
return the first one found that contains the specified content contentType.
type: Class contentType to search for
Returns:
If there is a plug-in in the dictionary that registered the requested
contentType then return the plug-in, if not then return null.

Rhino.Render.RdkPlugIn.AddPlugInToDictionary(System.IntPtr,System.Guid,System.Int32)
Create a new C++ runtime RDK plug-in object then create a RhinoCommon
RdkPlugIn, attach the C++ pointer to it and set the C++ callback
function pointers to the RckPlugIn.
rhinoPlugIn:
The C++ pointer to the native CRhinoPlugIn that is causing this RDK
plug-in to get added.
rhinoPlugInId: The plug-in Id
serialNumber: Plug-in C++ pointer serial number
Returns: