Rhino.Render.UI.UserInterfaceSection.#ctor(System.Int32,System.Windows.Forms.IWin32Window)
Internal constructor
serialNumber: C++ pointer serial number returned by the C interface wrapper.
window: The control created and embedded in the expandable tab control in the content browser.

Rhino.Render.UI.UserInterfaceSection.m_deleteThisProc
Called by the C++ destructor when a user interface section object is destroyed.

Rhino.Render.UI.UserInterfaceSection.m_displayDataProc
Called by the C++ SDK when it is time to initialize a user interface section.

Rhino.Render.UI.UserInterfaceSection.m_onExpandCallback
Called by the C++ SDK when a user interface section is being createExpanded
or collapsed.

Rhino.Render.UI.UserInterfaceSection.GetSiblings
Get a list of the RhinoCommon added content sections associated with
this sections container.
Returns:
Returns a list of the RhinoCommon added content sections associated
with this sections container.

Rhino.Render.UI.UserInterfaceSection.GetSibling(System.Guid)
Look for a UI section in the same container with the specified class Id.
id: The class Id of the section to search for.
Returns:
Returns the first section in this sections container whose window class
Id matches the specified Id or null if no match is found.

Rhino.Render.UI.UserInterfaceSection.FromWindow(System.Windows.Forms.IWin32Window)
Find the UserInterfaceSection that created the specified instance of a
window.
window:
If window is not null then look for the UserInterfaceSection that
created the window.
Returns:
If a UserInterfaceSection object is found containing a reference to
the requested window then return the object otherwise return null.

Rhino.Render.UI.UserInterfaceSection.GetSiblingIdList
Get a list of the RhinoCommon added content section serial numbers
associated with this sections container.
Returns:
Return a list of the RhinoCommon added content section serial numbers
associated with this sections container.