Rhino.Render.RenderPrimitiveEnumerator.#ctor(System.Guid,Rhino.DocObjects.ViewportInfo,System.Boolean)
plugInId:
The Id of the plug-in creating the iterator.
viewport:
The rendering view camera.
forceTriangleMeshes:
If true quad meshes will be triangulated