Rhino.Render.Fields.FieldDictionary.SetHelper``1(System.String,``0,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw an exception if the key name is invalid or if
T is not a supported data type.
Data type of the value parameter.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.