Rhino.UI.ObjectPropertiesPage.ProertyPageType.Material
Replace the material page with this page, only works are the current
render plug-in

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Light
Replace light page with this page, only works are the current render
plug-in

Rhino.UI.ObjectPropertiesPage.ProertyPageType.ObjectProperties
For internal use

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Dimension
If page is provided by Rhino and only dimensions are selected
activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Leader
If page is provided by Rhino and leaders are selected activate this
page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Text
If page is provided by Rhino and only text objects are selected
activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Hatch
If page is provided by Rhino and only hatch objects are selected
activate this page