Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)
Register custom render user interface with Rhino.  This should only be
done in Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels).  Panels
registered after Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels) is called
will be ignored.
plugin:
The plug-in providing the custom user interface
tabType:
The type of object to be created and added to the render container.
caption:
The caption for the custom user interface.
icon: