Rhino.Render.RenderContent.m_runtime_serial_number
Serial number of the created object, valid values:
-1  == OnDeleteRhCmnRenderContent() was called with this serial number
>0  == Value set by the constructor

Rhino.Render.RenderContent.m_current_serial_number
The next allocation serial number

Rhino.Render.RenderContent.m_CustomContentDictionary
Contains a list of objects with a m_runtime_serial_number > 0,
OnDeleteRhCmnRenderContent() will remove objects from the dictionary
by m_runtime_serial_number.

Rhino.Render.RenderContent.m_FieldDictionary
Rhino.Render.Fields FieldDictionary which provides access to setting
and retrieving field values.

Rhino.Render.RenderContent.GetString(Rhino.Render.RenderContent.StringIds)
Internal method used to get string values from the C++ SDK
which: Id of string value to get
Returns: Returns the requested string value.

Rhino.Render.RenderContent.OnGetDefaultsInteractive(System.IntPtr)
Override this method to prompt user for information necessary to
create a new content object.  For example, if you are created a
textured material you may prompt the user for a bitmap file name
prior to creating the textured material.
Returns:
If true is returned the content is created otherwise the creation
is aborted.

Rhino.Render.RenderContent.NewUiPointer(System.Guid,System.String,System.Boolean,System.Boolean,System.Windows.Forms.IWin32Window)
Create a new custom content user interface instance for this
RenderContext.
classId: The class Type Guid which was created.
caption: The expandable tab caption
createExpanded:
If this is true the tab will initially be expanded otherwise it will be
collapsed.
createVisible:
If this is true the tab will initially be visible otherwise it will be
hidden.
window: The user control to embed in the expandable tab.
Returns:
Returns the UserInterfaceSection object used to manage the new custom
UI.

Rhino.Render.RenderContent.m_UserInterfaceSections
Dictionary of all currently created UserInterfaceSection objects, when
the C++ pointer is deleted the object will be removed from this dictionary.

Rhino.Render.RenderContent.GetParameter(System.String)
Query the content instance for the value of a given named parameter.
If you do not support this parameter, call the base class.
parameterName: Name of the parameter
Returns:

Rhino.Render.RenderContent.SetParameter(System.String,System.Object,Rhino.Render.RenderContent.ChangeContexts)
Set the named parameter value for this content instance.
If you do not support this parameter, call the base class.
parameterName:
value:
changeContexts:
Returns:

Rhino.Render.RenderContent.ParamNameFromChildSlotName(System.String)
A "child slot" is the specific "slot" that a child (usually a texture) occupies.
This is generally the "use" of the child - in other words, the thing the child
operates on.  Some examples are "color", "transparency".
childSlotName: The named of the child slot to receive the parameter name for.
Returns: The default behaviour for these functions is to return the input string.  Sub-classes may (in the future) override these functions to provide different mappings.

Rhino.Render.RenderContent.DeleteChild(System.String,Rhino.Render.RenderContent.ChangeContexts)
childSlotName:
changeContexts:
Currently ignored, reserved for future use
Returns:

Rhino.Render.RenderContent.DeleteAllChildren(Rhino.Render.RenderContent.ChangeContexts)
changeContexts:
Currently ignored, reserved for future use

Rhino.Render.RenderContent.Icon(System.Drawing.Size)
Icon to display in the content browser, this bitmap needs to be valid for
the life of this content object, the content object that returns the bitmap
is responsible for disposing of the bitmap.
size:
Requested icon size
Returns:
Return Icon to display in the content browser.

Rhino.Render.RenderContent.Current
Determines if the content is considered the "Current" content - currently only used for Environments.

Rhino.Render.RenderContent.CurrentRenderContentChanged
Used to monitor render content preview updates.

Rhino.Render.RenderContent.ContentTypeAdded
Used to monitor render content types being registered.

Rhino.Render.RenderContent.ContentTypeDeleting
Used to monitor render content types being registered.

Rhino.Render.RenderContent.ContentTypeDeleted
Used to monitor render content types being registered.