Rhino.UI.LocalizationStringTable.LoadFromFile(System.Reflection.Assembly,System.Int32)
Look for a XML file with the current language ID and if one is not found then look in the specified assembly
for an embedded resource with the name "*.Localization.[locale]*.xml", if one is found then parse the XML
and extract the strings from it.
a: Check this assembly folder and its embedded resources for the specified locale XML file.
languageId: Locale ID to check for.
Returns: true if the operation was successful.

Rhino.UI.LocalizationStringTable.LocalizeComboBoxItems(System.String,System.String,System.Windows.Forms.ComboBox)
Localizes combo list items.
formName: The form name.
formClassName: The form class name.
cb: A Windows Forms combo box.