Rhino.RhinoApp.AskUserForRhinoLicense(System.Boolean,System.Windows.Forms.IWin32Window)
Causes Rhino to display UI asking the user to enter a license for Rhino or use one from the Zoo.
standAlone: True to ask for a stand-alone license, false to ask the user for a license from the Zoo
parent: Parent window for the user interface dialog.
Returns: