Rhino.Render.CustomRenderMeshProvider.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)
Determines if custom render meshes will be built for a particular object.
vp: The viewport being rendered.
obj: The Rhino object of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: true if custom meshes will be built.

Rhino.Render.CustomRenderMeshProvider.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)
Build custom render mesh(es).
vp: The viewport being rendered.
objMeshes: The meshes class to populate with custom meshes.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType: Type of mesh to build.
Returns: true if operation was successful.

Rhino.Render.CustomRenderMeshProvider.ObjectChanged(Rhino.DocObjects.RhinoObject)
obj:

Rhino.Render.CustomRenderMeshProvider.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)
Returns a bounding box for the custom render meshes for the given object.
vp: The viewport being rendered.
obj: The Rhino object of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: A bounding box value.