Rhino.Render.Decal.Id
Gets the decal ID associated with this decal.

Rhino.Render.Decal.StartLatitude
Gets the start latitude of the decal's sweep. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.EndLatitude
Gets the stop latitude of the decal's sweep. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.StartLongitude
Gets the start longitude of the decal's sweep. Only used when mapping is spherical.

Rhino.Render.Decal.EndLongitude
Gets the stop longitude of the decal's sweep. Only used when mapping is spherical.