Rhino.DocObjects.Layer.RenderMaterial
Gets or sets the Rhino.Render.RenderMaterial for objects on
this layer that have MaterialSource() == MaterialFromLayer.
A null result indicates that no Rhino.Render.RenderMaterial has
been assigned  and the material created by the default Material
constructor or the Rhino.DocObjects.Layer.RenderMaterialIndex should be used.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.