Rhino.Render.RenderMaterial.StandardChildSlots.Diffuse
Corresponds to ON_Texture::bitmap_texture.

Rhino.Render.RenderMaterial.StandardChildSlots.Bump
Corresponds to ON_Texture::bump_texture.

Rhino.Render.RenderMaterial.StandardChildSlots.Environment
Corresponds to ON_Texture::emap_texture.